//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] XCradleNicRomCtrl.uni
// [Description] Declaration of NicRomCtrl uni string
// [Author] AMIJN
// [Date] 2021/02/07
//******************************************************************************

//**********************************************************************
// $Header: /XCradleStandardPkg\Universal\XCradlePxeBoot\XCradleNicRomCtrl\XCradleNicRomCtrl.uni 1    9/17/18  Anna $
//
// $Revision: 1 $
//
// $Date: 9/17/18 $
//**********************************************************************
// Revision History
// ----------------
// $Log: /XCradleStandardPkg\Universal\XCradlePxeBoot\XCradleNicRomCtrl\XCradleNicRomCtrl.uni $
//
// 1   9/17/18  Anna
//
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  XCradleNicRomCtrl.uni
//
// Description:
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string OEM_NICOPROM                     #language en-US "OEM NIC Oprom Ctrl"
                                         #language zh-chs "OEM NIC操作程序控制 "
                                         #language x-AMI "OemNICOpromCtrl"
#string OEM_NICOPROM_HELP                #language en-US "Enable/Disable All NIC Oprom Execution on Platform"
                                         #language zh-chs " 禁用或者启用平台上所有的NIC 操作程序"
#string OEM_GLOBAL_NICOPROM              #language en-US "Global NIC Oprom Ctrl"
                                         #language zh-chs "全局 NIC操作程序控制 "
                                         #language x-AMI "OemGlobalNicoprom"
#string OEM_GLOBAL_NICOPROM_HELP         #language en-US "Enable/Disable NIC Oprom of Onboard and Slot"
                                         #language zh-chs "禁用或者启用板载和插槽上所有的NIC操作程序"
#string OEM_ONBOARD_NICOPROM             #language en-US "Onboard NIC Oprom Ctrl"
                                         #language zh-chs "板载 NIC操作程序控制 "
                                         #language x-AMI "OemOnboardNicoprom"
#string OEM_ONBOARD_NICOPROM_HELP        #language en-US "Enable/Disable NIC Oprom of Onboard"
                                         #language zh-chs "禁用或者启用板载上所有的NIC操作程序"
#string OEM_SLOT_NICOPROM                #language en-US "Slot NIC Oprom Ctrl"
                                         #language zh-chs "插槽NIC操作程序控制 "
                                         #language x-AMI "OemSlotNicoprom"
#string OEM_SLOT_NICOPROM_HELP           #language en-US "Enable/Disable NIC Oprom which on slot"
                                         #language zh-chs "禁用或者启用插槽上所有的NIC操作程序"

#string STR_ENABLED                      #language en-US "Enabled"
                                         #language zh-chs "启用"
#string STR_DISABLED                     #language en-US "Disabled"
                                         #language zh-chs "禁用"

//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************